{
  "meta": {
    "method_name": "Label-free decoy-competition (knockoff+) FDR gate for LLM text->logic fact admission, with auditable trace-graphs",
    "anchor": "24-doc application anchor (8 legal CUAD-crisp / 8 news Wikinews-silver / 8 regulatory GDPR+eCFR-silver)",
    "headline_finding": "Decoy-gating reduces the hallucinated-fact rate vs raw LLM in 0 of the grid cells with CI separation; the largest CI-separated reduction is at regulatory/portable/alpha=0.5: raw=0.439 -> gate=0.360 (abs 0.079).",
    "models": {
      "primary_scorer_generator": "openai/gpt-4.1-nano",
      "cross_family_adjudicator": "mistralai/ministral-8b-2512"
    },
    "engine": "problog",
    "engines_used": [
      "leaf_weight",
      "problog"
    ],
    "problog_available": true,
    "mapping_default": "gate_consistent_shrinkage",
    "weight_map": {
      "gate_consistent_shrinkage": "w_i = (1 - alpha_hat) * calibrate(Z_i)  [DEFAULT]",
      "per_pair_margin": "w_i = clip(0.5 + 0.5*W_i, eps, 1-eps)",
      "identity_no_shrinkage": "w_i = calibrate(Z_i), alpha_hat=0  [sensitivity baseline]",
      "calibrate": "identity clamp Z_i -> [eps, 1-eps] (label-free, monotone)",
      "alpha_hat_source": "decoy_fdr_hat of the operative (genre, portable, alpha=0.5) gate cell"
    },
    "alpha_hat_by_genre": {
      "legal": 0.458333,
      "news": 0.5,
      "regulatory": 0.5,
      "pooled": 0.5
    },
    "self_report_regime": "conservative",
    "prob_note": "deterministic backward-chaining remains the baseline; NO headline number depends on ProbLog. Multi-hop probabilistic marginals are demonstrated on regulatory (real cross_references+grants_right bridges); legal/news show single-fact probabilistic admissions (marginal = the leaf's calibrated unification weight)."
  },
  "prob_trace_graphs": [
    {
      "doc_id": "legal_cuad_00",
      "genre": "legal",
      "engine": "problog",
      "kind": "multi_hop",
      "graphs": [
        {
          "nodes": [
            {
              "id": 0,
              "label": "party_bound_effective(Premium Managed Hosting Agreement, AstroNutrition.com, March 1, 2005)",
              "kind": "derived",
              "rule": "party_bound_effective",
              "prob": 0.19506
            },
            {
              "id": 1,
              "label": "has_party(Premium Managed Hosting Agreement, AstroNutrition.com)",
              "kind": "leaf",
              "prob": 0.456141,
              "cert": {
                "provenance": "This is a managed hosting agreement between AstroNutrition.com and deep systems.",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.8421,
                  "T": 0.129032,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.72,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "effective_date(Premium Managed Hosting Agreement, March 1, 2005)",
              "kind": "leaf",
              "prob": 0.427632,
              "cert": {
                "provenance": "The effective term is 12 months beginning March 1, 2005",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.7895,
                  "T": 0.129032,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.72,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "party_bound_effective"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "party_bound_effective"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "party_bound_effective(Premium Managed Hosting Agreement, deep systems, March 1, 2005)",
              "kind": "derived",
              "rule": "party_bound_effective",
              "prob": 0.219443
            },
            {
              "id": 1,
              "label": "has_party(Premium Managed Hosting Agreement, deep systems)",
              "kind": "leaf",
              "prob": 0.513158,
              "cert": {
                "provenance": "This is a managed hosting agreement between AstroNutrition.com and deep systems.",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.9474,
                  "T": 0.129032,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.72,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "effective_date(Premium Managed Hosting Agreement, March 1, 2005)",
              "kind": "leaf",
              "prob": 0.427632,
              "cert": {
                "provenance": "The effective term is 12 months beginning March 1, 2005",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.7895,
                  "T": 0.129032,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.72,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "party_bound_effective"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "party_bound_effective"
            }
          ]
        }
      ],
      "marginals": [
        {
          "conclusion": [
            "party_bound_effective",
            [
              "Premium Managed Hosting Agreement",
              "deep systems",
              "March 1, 2005"
            ]
          ],
          "marginal": 0.219442781856
        },
        {
          "conclusion": [
            "party_bound_effective",
            [
              "Premium Managed Hosting Agreement",
              "AstroNutrition.com",
              "March 1, 2005"
            ]
          ],
          "marginal": 0.195060488112
        }
      ],
      "program": "0.313597::agreement_date('Premium Managed Hosting Agreement','03/01/05').\n0.427632::effective_date('Premium Managed Hosting Agreement','March 1, 2005').\n0.342105::expiration_date('Premium Managed Hosting Agreement','February 28, 2006').\n0.456141::has_party('Premium Managed Hosting Agreement','AstroNutrition.com').\n0.513158::has_party('Premium Managed Hosting Agreement','deep systems').\nparty_bound_effective(A,P,D) :- has_party(A,P), effective_date(A,D).\ntitled_dated(A,T,D) :- has_title(A,T), agreement_date(A,D).\nquery(party_bound_effective('Premium Managed Hosting Agreement','AstroNutrition.com','March 1, 2005')).\nquery(party_bound_effective('Premium Managed Hosting Agreement','deep systems','March 1, 2005'))."
    },
    {
      "doc_id": "news_wikinews_02",
      "genre": "news",
      "engine": "leaf_weight",
      "kind": "admission",
      "graphs": [
        {
          "nodes": [
            {
              "id": 0,
              "label": "admitted_fact(choose(The Justice and Development Party,Abdullah Gül))",
              "kind": "derived",
              "rule": "admission",
              "prob": 0.368421
            },
            {
              "id": 1,
              "label": "choose(The Justice and Development Party, Abdullah Gül)",
              "kind": "leaf",
              "prob": 0.368421,
              "cert": {
                "provenance": "The ruling AKP chose Abdullah Gül as their candidate instead",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.7368,
                  "T": 0.191489,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.871795,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "admission"
            }
          ]
        }
      ],
      "marginals": [
        {
          "conclusion": [
            "admitted_fact",
            [
              "choose(The Justice and Development Party,Abdullah Gül)"
            ]
          ],
          "marginal": 0.3684210526315789
        }
      ],
      "program": "0.368421::choose('The Justice and Development Party','Abdullah Gül').\nco_occurring(X,Y,D) :- occurred_on(X,D), occurred_on(Y,D)."
    },
    {
      "doc_id": "reg_gdpr_07",
      "genre": "regulatory",
      "engine": "problog",
      "kind": "multi_hop",
      "graphs": [
        {
          "nodes": [
            {
              "id": 0,
              "label": "titled_obligation(Art. 7 GDPR, Conditions for consent, present consent request in a clearly distinguishable manner)",
              "kind": "derived",
              "rule": "titled_obligation",
              "prob": 0.049867
            },
            {
              "id": 1,
              "label": "has_title(Art. 7 GDPR, Conditions for consent)",
              "kind": "leaf",
              "prob": 0.34,
              "cert": {
                "provenance": "Art. 7 GDPR Conditions for consent",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.68,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "obligates(Art. 7 GDPR, present consent request in a clearly distinguishable manner)",
              "kind": "leaf",
              "prob": 0.146667,
              "cert": {
                "provenance": "the request for consent shall be presented in a manner which is clearly distinguishable from the other matters",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.3333,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "titled_obligation"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "titled_obligation"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "titled_obligation(Art. 7 GDPR, Conditions for consent, use clear and plain language in consent declaration)",
              "kind": "derived",
              "rule": "titled_obligation",
              "prob": 0.058933
            },
            {
              "id": 1,
              "label": "has_title(Art. 7 GDPR, Conditions for consent)",
              "kind": "leaf",
              "prob": 0.34,
              "cert": {
                "provenance": "Art. 7 GDPR Conditions for consent",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.68,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "obligates(Art. 7 GDPR, use clear and plain language in consent declaration)",
              "kind": "leaf",
              "prob": 0.173333,
              "cert": {
                "provenance": "using clear and plain language.",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.48,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "titled_obligation"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "titled_obligation"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "titled_obligation(Art. 7 GDPR, assess whether consent is freely given, present consent request in a clearly distinguishable manner)",
              "kind": "derived",
              "rule": "titled_obligation",
              "prob": 0.0264
            },
            {
              "id": 1,
              "label": "has_title(Art. 7 GDPR, assess whether consent is freely given)",
              "kind": "leaf",
              "prob": 0.18,
              "cert": {
                "provenance": "When assessing whether consent is freely given, utmost account shall be taken of whether ... the performance of a contract, including the provision of a service, is conditional on consent to the processing of personal data that is not necessary for the performance of that contract.",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": 0.36,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "obligates(Art. 7 GDPR, present consent request in a clearly distinguishable manner)",
              "kind": "leaf",
              "prob": 0.146667,
              "cert": {
                "provenance": "the request for consent shall be presented in a manner which is clearly distinguishable from the other matters",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.3333,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "titled_obligation"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "titled_obligation"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "titled_obligation(Art. 7 GDPR, assess whether consent is freely given, use clear and plain language in consent declaration)",
              "kind": "derived",
              "rule": "titled_obligation",
              "prob": 0.0312
            },
            {
              "id": 1,
              "label": "has_title(Art. 7 GDPR, assess whether consent is freely given)",
              "kind": "leaf",
              "prob": 0.18,
              "cert": {
                "provenance": "When assessing whether consent is freely given, utmost account shall be taken of whether ... the performance of a contract, including the provision of a service, is conditional on consent to the processing of personal data that is not necessary for the performance of that contract.",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": 0.36,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "obligates(Art. 7 GDPR, use clear and plain language in consent declaration)",
              "kind": "leaf",
              "prob": 0.173333,
              "cert": {
                "provenance": "using clear and plain language.",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.48,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "titled_obligation"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "titled_obligation"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "titled_obligation(Art. 7 GDPR, infringement of this Regulation shall not be binding, present consent request in a clearly distinguishable manner)",
              "kind": "derived",
              "rule": "titled_obligation",
              "prob": 0.000978
            },
            {
              "id": 1,
              "label": "has_title(Art. 7 GDPR, infringement of this Regulation shall not be binding)",
              "kind": "leaf",
              "prob": 0.006667,
              "cert": {
                "provenance": "Any part of such a declaration which constitutes an infringement of this Regulation shall not be binding.",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": -0.4933,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "obligates(Art. 7 GDPR, present consent request in a clearly distinguishable manner)",
              "kind": "leaf",
              "prob": 0.146667,
              "cert": {
                "provenance": "the request for consent shall be presented in a manner which is clearly distinguishable from the other matters",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.3333,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "titled_obligation"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "titled_obligation"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "titled_obligation(Art. 7 GDPR, infringement of this Regulation shall not be binding, use clear and plain language in consent declaration)",
              "kind": "derived",
              "rule": "titled_obligation",
              "prob": 0.001156
            },
            {
              "id": 1,
              "label": "has_title(Art. 7 GDPR, infringement of this Regulation shall not be binding)",
              "kind": "leaf",
              "prob": 0.006667,
              "cert": {
                "provenance": "Any part of such a declaration which constitutes an infringement of this Regulation shall not be binding.",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": -0.4933,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "obligates(Art. 7 GDPR, use clear and plain language in consent declaration)",
              "kind": "leaf",
              "prob": 0.173333,
              "cert": {
                "provenance": "using clear and plain language.",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.48,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "titled_obligation"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "titled_obligation"
            }
          ]
        }
      ],
      "marginals": [
        {
          "conclusion": [
            "titled_obligation",
            [
              "declaration",
              "using clear and plain language",
              "request for consent shall be presented clearly distinguishable from other matters"
            ]
          ],
          "marginal": 0.04977762888900002
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "declaration",
              "shall be presented in an intelligible and easily accessible form",
              "request for consent shall be presented clearly distinguishable from other matters"
            ]
          ],
          "marginal": 0.009333320000000004
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "declaration",
              "intelligible and easily accessible form",
              "request for consent shall be presented clearly distinguishable from other matters"
            ]
          ],
          "marginal": 0.015555611110999998
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "declaration",
              "any part which constitutes an infringement of this Regulation shall not be binding",
              "request for consent shall be presented clearly distinguishable from other matters"
            ]
          ],
          "marginal": 0.052888891111
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "Art. 7 GDPR",
              "infringement of this Regulation shall not be binding",
              "use clear and plain language in consent declaration"
            ]
          ],
          "marginal": 0.0011556111110000004
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "Art. 7 GDPR",
              "assess whether consent is freely given",
              "use clear and plain language in consent declaration"
            ]
          ],
          "marginal": 0.03119993999999999
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "Art. 7 GDPR",
              "Conditions for consent",
              "use clear and plain language in consent declaration"
            ]
          ],
          "marginal": 0.05893322
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "Art. 7 GDPR",
              "infringement of this Regulation shall not be binding",
              "present consent request in a clearly distinguishable manner"
            ]
          ],
          "marginal": 0.0009778288889999997
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "Art. 7 GDPR",
              "assess whether consent is freely given",
              "present consent request in a clearly distinguishable manner"
            ]
          ],
          "marginal": 0.02640006
        },
        {
          "conclusion": [
            "titled_obligation",
            [
              "Art. 7 GDPR",
              "Conditions for consent",
              "present consent request in a clearly distinguishable manner"
            ]
          ],
          "marginal": 0.04986678000000001
        }
      ],
      "program": "0.340000::has_title('Art. 7 GDPR','Conditions for consent').\n0.326667::obligates('controller','demonstrate that the data subject has consented to processing of his or her personal data').\n0.186667::has_title('data subject','be informed prior to giving consent').\n0.053333::has_title('data subject','the right to withdraw his or her consent at any time').\n0.133333::grants_right('consent','to process personal data').\n0.180000::has_title('Art. 7 GDPR','assess whether consent is freely given').\n0.006667::has_title('Art. 7 GDPR','infringement of this Regulation shall not be binding').\n0.146667::obligates('Art. 7 GDPR','present consent request in a clearly distinguishable manner').\n0.173333::obligates('Art. 7 GDPR','use clear and plain language in consent declaration').\n0.140000::has_title('consent','be conditional on performance of a contract').\n0.013333::has_title('consent','be given in a clearly distinguishable manner').\n0.293333::obligates('controller','make it as easy to withdraw as to give consent').\n0.106667::has_title('data subject','withdraw as easy as to give consent').\n0.253333::has_title('data subject','withdraw consent as easily as giving it').\n0.226667::has_title('declaration','any part which constitutes an infringement of this Regulation shall not be binding').\n0.066667::has_title('declaration','intelligible and easily accessible form').\n0.040000::has_title('declaration','shall be presented in an intelligible and easily accessible form').\n0.213333::has_title('declaration','using clear and plain language').\n0.233333::obligates('declaration','request for consent shall be presented clearly distinguishable from other matters').\nrelevant_right(A,R) :- cross_references(A,B), grants_right(B,R).\nobligation_with_exception(A,O,E) :- obligates(A,O), has_exception(A,E).\ntitled_obligation(A,T,O) :- has_title(A,T), obligates(A,O).\nquery(titled_obligation('Art. 7 GDPR','Conditions for consent','present consent request in a clearly distinguishable manner')).\nquery(titled_obligation('Art. 7 GDPR','Conditions for consent','use clear and plain language in consent declaration')).\nquery(titled_obligation('Art. 7 GDPR','assess whether consent is freely given','present consent request in a clearly distinguishable manner')).\nquery(titled_obligation('Art. 7 GDPR','assess whether consent is freely given','use clear and plain language in consent declaration')).\nquery(titled_obligation('Art. 7 GDPR','infringement of this Regulation shall not be binding','present consent request in a clearly distinguishable manner')).\nquery(titled_obligation('Art. 7 GDPR','infringement of this Regulation shall not be binding','use clear and plain language in consent declaration')).\nquery(titled_obligation('declaration','any part which constitutes an infringement of this Regulation shall not be binding','request for consent shall be presented clearly distinguishable from other matters')).\nquery(titled_obligation('declaration','intelligible and easily accessible form','request for consent shall be presented clearly distinguishable from other matters')).\nquery(titled_obligation('declaration','shall be presented in an intelligible and easily accessible form','request for consent shall be presented clearly distinguishable from other matters')).\nquery(titled_obligation('declaration','using clear and plain language','request for consent shall be presented clearly distinguishable from other matters'))."
    },
    {
      "doc_id": "reg_gdpr_13",
      "genre": "regulatory",
      "engine": "problog",
      "kind": "multi_hop",
      "graphs": [
        {
          "nodes": [
            {
              "id": 0,
              "label": "obligation_with_exception(controller, provide all of the following information at the time when personal data are obtained, where and insofar as the data subject already has the information)",
              "kind": "derived",
              "rule": "obligation_with_exception",
              "prob": 0.131488
            },
            {
              "id": 1,
              "label": "obligates(controller, provide all of the following information at the time when personal data are obtained)",
              "kind": "leaf",
              "prob": 0.352941,
              "cert": {
                "provenance": "the controller shall, at the time when personal data are obtained, provide the data subject with all of the following information",
                "provenance_char_span": null,
                "hallucination_verdict": "HALLUCINATED",
                "decoy_certificate": {
                  "W_i": -0.8039,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "has_exception(controller, where and insofar as the data subject already has the information)",
              "kind": "leaf",
              "prob": 0.372549,
              "cert": {
                "provenance": "Paragraphs 1, 2 and 3 shall not apply where and insofar as the data subject already has the information",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.7451,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "obligation_with_exception"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "obligation_with_exception"
            }
          ]
        },
        {
          "nodes": [
            {
              "id": 0,
              "label": "obligation_with_exception(controller, to provide the data subject with additional information necessary to ensure fair and transparent processing, where and insofar as the data subject already has the information)",
              "kind": "derived",
              "rule": "obligation_with_exception",
              "prob": 0.080354
            },
            {
              "id": 1,
              "label": "obligates(controller, to provide the data subject with additional information necessary to ensure fair and transparent processing)",
              "kind": "leaf",
              "prob": 0.215686,
              "cert": {
                "provenance": "In addition to the information referred to in paragraph 1, the controller shall, at the time when personal data are obtained, provide the data subject with the following further information necessary to ensure fair and transparent processing",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.4314,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            },
            {
              "id": 2,
              "label": "has_exception(controller, where and insofar as the data subject already has the information)",
              "kind": "leaf",
              "prob": 0.372549,
              "cert": {
                "provenance": "Paragraphs 1, 2 and 3 shall not apply where and insofar as the data subject already has the information",
                "provenance_char_span": null,
                "hallucination_verdict": "ENTAILED",
                "decoy_certificate": {
                  "W_i": 0.7451,
                  "T": 0.338462,
                  "alpha": 0.5
                },
                "entrapment_certificate": {
                  "FDP_hat": 0.93617,
                  "r": 1
                }
              }
            }
          ],
          "edges": [
            {
              "src": 0,
              "dst": 1,
              "rule": "obligation_with_exception"
            },
            {
              "src": 0,
              "dst": 2,
              "rule": "obligation_with_exception"
            }
          ]
        }
      ],
      "marginals": [
        {
          "conclusion": [
            "obligation_with_exception",
            [
              "controller",
              "to provide the data subject with additional information necessary to ensure fair and transparent processing",
              "where and insofar as the data subject already has the information"
            ]
          ],
          "marginal": 0.08035360361400001
        },
        {
          "conclusion": [
            "obligation_with_exception",
            [
              "controller",
              "provide all of the following information at the time when personal data are obtained",
              "where and insofar as the data subject already has the information"
            ]
          ],
          "marginal": 0.13148781660900002
        }
      ],
      "program": "0.490196::has_title('Art. 13 GDPR','Information to be provided where personal data are collected from the data subject').\n0.294118::cross_references('Article 13 GDPR','the obligation to provide information when personal data are collected from the data subject').\n0.009804::cross_references('controller','reference to the appropriate or suitable safeguards and the means by which to obtain a copy of them').\n0.107843::cross_references('controller','the existence of automated decision-making, including profiling').\n0.029412::cross_references('controller','the existence or absence of an adequacy decision by the Commission').\n0.147059::cross_references('controller','the fact that the controller intends to transfer personal data to a third country or international organisation').\n0.421569::cross_references('controller','the purposes of the processing for which the personal data are intended as well as the legal basis for the processing').\n0.156863::cross_references('controller','the right to withdraw consent at any time').\n0.098039::cross_references('controller','whether the provision of personal data is a statutory or contractual requirement').\n0.372549::has_exception('controller','where and insofar as the data subject already has the information').\n0.352941::obligates('controller','provide all of the following information at the time when personal data are obtained').\n0.215686::obligates('controller','to provide the data subject with additional information necessary to ensure fair and transparent processing').\n0.343137::grants_right('data subject','to request from the controller access to and rectification or erasure of personal data or restriction of processing concerning the data subject or to object to processing as well as the right to data portability').\nrelevant_right(A,R) :- cross_references(A,B), grants_right(B,R).\nobligation_with_exception(A,O,E) :- obligates(A,O), has_exception(A,E).\ntitled_obligation(A,T,O) :- has_title(A,T), obligates(A,O).\nquery(obligation_with_exception('controller','provide all of the following information at the time when personal data are obtained','where and insofar as the data subject already has the information')).\nquery(obligation_with_exception('controller','to provide the data subject with additional information necessary to ensure fair and transparent processing','where and insofar as the data subject already has the information'))."
    }
  ],
  "prob_examples": [
    {
      "doc_id": "legal_cuad_00",
      "genre": "legal",
      "engine": "problog",
      "kind": "multi_hop",
      "rule": "party_bound_effective",
      "conclusion": [
        "party_bound_effective",
        [
          "Premium Managed Hosting Agreement",
          "AstroNutrition.com",
          "March 1, 2005"
        ]
      ],
      "marginal": 0.195060488112,
      "n_conclusions": 2,
      "json_path": "prob_trace_graphs/prob_trace_legal_cuad_00.json",
      "dot_path": "prob_trace_graphs/prob_trace_legal_cuad_00.dot"
    },
    {
      "doc_id": "news_wikinews_02",
      "genre": "news",
      "engine": "leaf_weight",
      "kind": "admission",
      "rule": "admission",
      "conclusion": [
        "admitted_fact",
        [
          "choose(The Justice and Development Party,Abdullah Gül)"
        ]
      ],
      "marginal": 0.3684210526315789,
      "n_conclusions": 1,
      "json_path": "prob_trace_graphs/prob_trace_news_wikinews_02.json",
      "dot_path": "prob_trace_graphs/prob_trace_news_wikinews_02.dot"
    },
    {
      "doc_id": "reg_gdpr_07",
      "genre": "regulatory",
      "engine": "problog",
      "kind": "multi_hop",
      "rule": "titled_obligation",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "Conditions for consent",
          "present consent request in a clearly distinguishable manner"
        ]
      ],
      "marginal": 0.04986678000000001,
      "n_conclusions": 10,
      "json_path": "prob_trace_graphs/prob_trace_reg_gdpr_07.json",
      "dot_path": "prob_trace_graphs/prob_trace_reg_gdpr_07.dot"
    },
    {
      "doc_id": "reg_gdpr_13",
      "genre": "regulatory",
      "engine": "problog",
      "kind": "multi_hop",
      "rule": "obligation_with_exception",
      "conclusion": [
        "obligation_with_exception",
        [
          "controller",
          "provide all of the following information at the time when personal data are obtained",
          "where and insofar as the data subject already has the information"
        ]
      ],
      "marginal": 0.13148781660900002,
      "n_conclusions": 2,
      "json_path": "prob_trace_graphs/prob_trace_reg_gdpr_13.json",
      "dot_path": "prob_trace_graphs/prob_trace_reg_gdpr_13.dot"
    }
  ],
  "sensitivity_shrinkage_vs_margin": [
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "Conditions for consent",
          "present consent request in a clearly distinguishable manner"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.04986678000000001,
      "marginal_per_pair_margin": 0.27999972,
      "marginal_identity_no_shrinkage": 0.19946644000000002
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "Conditions for consent",
          "use clear and plain language in consent declaration"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.05893322,
      "marginal_per_pair_margin": 0.2184,
      "marginal_identity_no_shrinkage": 0.23573355999999998
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "assess whether consent is freely given",
          "present consent request in a clearly distinguishable manner"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.02640006,
      "marginal_per_pair_margin": 0.22666644,
      "marginal_identity_no_shrinkage": 0.10559988000000002
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "assess whether consent is freely given",
          "use clear and plain language in consent declaration"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.03119993999999999,
      "marginal_per_pair_margin": 0.1768,
      "marginal_identity_no_shrinkage": 0.12480011999999996
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "infringement of this Regulation shall not be binding",
          "present consent request in a clearly distinguishable manner"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.0009778288889999997,
      "marginal_per_pair_margin": 0.084444248889,
      "marginal_identity_no_shrinkage": 0.003911008888999999
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "Art. 7 GDPR",
          "infringement of this Regulation shall not be binding",
          "use clear and plain language in consent declaration"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.0011556111110000004,
      "marginal_per_pair_margin": 0.06586657999999998,
      "marginal_identity_no_shrinkage": 0.004622111111000001
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "declaration",
          "any part which constitutes an infringement of this Regulation shall not be binding",
          "request for consent shall be presented clearly distinguishable from other matters"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.052888891111,
      "marginal_per_pair_margin": 0.5328888911109999,
      "marginal_identity_no_shrinkage": 0.211555551111
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "declaration",
          "intelligible and easily accessible form",
          "request for consent shall be presented clearly distinguishable from other matters"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.015555611110999998,
      "marginal_per_pair_margin": 0.24933322000000002,
      "marginal_identity_no_shrinkage": 0.06222211111099999
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "declaration",
          "shall be presented in an intelligible and easily accessible form",
          "request for consent shall be presented clearly distinguishable from other matters"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.009333320000000004,
      "marginal_per_pair_margin": 0.283555671111,
      "marginal_identity_no_shrinkage": 0.03733335999999998
    },
    {
      "doc_id": "reg_gdpr_07",
      "conclusion": [
        "titled_obligation",
        [
          "declaration",
          "using clear and plain language",
          "request for consent shall be presented clearly distinguishable from other matters"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.04977762888900002,
      "marginal_per_pair_margin": 0.523110628889,
      "marginal_identity_no_shrinkage": 0.199111408889
    },
    {
      "doc_id": "reg_gdpr_13",
      "conclusion": [
        "obligation_with_exception",
        [
          "controller",
          "provide all of the following information at the time when personal data are obtained",
          "where and insofar as the data subject already has the information"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.13148781660900002,
      "marginal_per_pair_margin": 0.085543831411,
      "marginal_identity_no_shrinkage": 0.525951266436
    },
    {
      "doc_id": "reg_gdpr_13",
      "conclusion": [
        "obligation_with_exception",
        [
          "controller",
          "to provide the data subject with additional information necessary to ensure fair and transparent processing",
          "where and insofar as the data subject already has the information"
        ]
      ],
      "alpha_hat": 0.5,
      "marginal_gate_consistent_shrinkage": 0.08035360361400001,
      "marginal_per_pair_margin": 0.624471103614,
      "marginal_identity_no_shrinkage": 0.321415159554
    }
  ],
  "honest_reporting": {
    "atomic_reduction_pooled": {
      "by_cell": [
        {
          "elicitation": "logprob",
          "alpha": 0.05,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "logprob",
          "alpha": 0.1,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "logprob",
          "alpha": 0.2,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "logprob",
          "alpha": 0.3,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "logprob",
          "alpha": 0.5,
          "raw": 0.245192,
          "gate": 0.17931,
          "diff": 0.065882,
          "rel_reduction": 0.268696,
          "diff_ci": [
            -0.01585865833955913,
            0.14252384438329604
          ],
          "ci_separated": false,
          "n_admitted": 145,
          "directional": true
        },
        {
          "elicitation": "portable",
          "alpha": 0.05,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "portable",
          "alpha": 0.1,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "portable",
          "alpha": 0.2,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "portable",
          "alpha": 0.3,
          "raw": 0.245192,
          "gate": null,
          "diff": null,
          "rel_reduction": null,
          "diff_ci": [
            null,
            null
          ],
          "ci_separated": false,
          "n_admitted": 0,
          "directional": false
        },
        {
          "elicitation": "portable",
          "alpha": 0.5,
          "raw": 0.245192,
          "gate": 0.180328,
          "diff": 0.064864,
          "rel_reduction": 0.264544,
          "diff_ci": [
            -0.012024320858008542,
            0.1477535113413252
          ],
          "ci_separated": false,
          "n_admitted": 122,
          "directional": true
        }
      ],
      "cells_ci_separated_pooled": 0,
      "n_pooled_cells": 10,
      "cells_ci_separated_allgrid": 0,
      "n_allgrid_cells": 40,
      "directional_not_significant": true,
      "headline_alpha": 0.5,
      "note": "Pooled atomic hallucinated-fact reduction is DIRECTIONAL, not CI-separated at n=24: 0/40 grid cells and 0/10 pooled cells have a raw-gate difference CI excluding 0. Reported as a ~25% relative-reduction trend with auditable provenance, NOT a significant reduction."
    },
    "multihop_corruption": {
      "by_genre": {
        "legal": {
          "raw": {
            "derived": 9,
            "corrupt": 0,
